// Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
// Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
// Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
// Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).
// Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

//Task 1: Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….)
let result = '';

for (let i = 20; i <= 30; i += 0.5) {
    result += i + ' ';
}

console.log(result);
console.log('');

//Task 2: Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
let dollar = 27;

for (let dollars = 10; dollars <= 100; dollars += 10) {
    const grivna = dollars * dollar;
    console.log(`${dollars} $ = ${grivna} UAH`);
}
console.log('');

//Task 3: Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
let num = 30;
let str = '';

for (let i = 1; i <= 100; i++){
    if (i ** 2 <= num) {
        str += i + ' ';
    }
}
console.log(str);
console.log('');

//Task 4: Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).
function isPrime(number) {
    if (number <= 1) {
        return console.log(`Число ${intNum} не є простим`);
    }

    for (let i = 2; i <= number; i++) {
        if (number % i === 0) {
            return console.log(`Число ${intNum} не є простим`);
        }
    }

    return console.log(`Число ${intNum} є простим`);
}

let intNum = 19;
isPrime(intNum);
console.log('');

//Task 5: Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).
let someNum = 33;
let check = false;
let resultDegree;

for (let degree = 1; degree <= 10; degree++) {
    if (3 ** degree === someNum) {
        resultDegree = degree;
        check = true;
        break;
    }
}

if (check) {
    console.log(`3 ^ ${resultDegree} = ${someNum}`);
}
else {
    console.log('Такого числа при возведені трійки у ступень не існує');
}
console.log('');